import type { NewsType } from '@/shared/types/news-type.ts'

export const defaultNews: NewsType[] = [
  {
    id: '1',
    title: 'Манулы — главные интроверты в мире животных',
    content:
      'Этих животных тяжело отыскать: они водятся в основном в степях Забайкалья и в частях Монголии, которые граничат с данным регионом. Кроме того, их видели в ряде регионов Центральной Азии. Это ярко выраженные интроверты. Каждая кошка проживает на собственной территории площадью примерно 4 кв. км, а встречаются они лишь в период брачного сезона весной.',
    date: '17.06.2025',
    image: 'https://news-img.gismeteo.st/ru/2025/06/shutterstock_1522666382-640x427.jpg',
  },
  {
    id: '2',
    title: 'Валлийская черноносая: одна из самых милых пород овец',
    content:
      'Валлийская черноносая овца — одна из самых милых пород в мире, родом из верхнего региона Вале в Швейцарии. Она была выведена для получения мяса и шерсти, и её история восходит к XV веку. Несмотря на трудности, такие как эпидемии в 1930-х и 1940-х годах, порода была официально признана в 1962 году. Эти овцы отличаются черными мордочками, кудрявой шерстью и черными пятнами на коленях и лодыжках. Высота самок достигает 72–78 см, а самцов — 75–83 см. Взрослые особи весят от 70 до 125 кг. Черноносые овцы также имеют стандарты, аналогичные выставочным собакам, включая спиральные рога и широкую грудь.',
    date: '17.06.2025',
    image: 'https://news-img.gismeteo.st/ru/2025/06/shutterstock_1781986112-640x455.jpg',
  },
  {
    id: '3',
    title: 'Русская голубая — культовая порода кошек',
    content:
      'Когда говорят о породах голубых кошек, русская голубая обычно является гвоздем программы. Известные своей густой двойной шерстью с серебристыми кончиками, эти кошки имеют плюшевую текстуру и мерцающий голубовато-серый вид. Если добавить к этому ярко-зеленые глаза и грациозность, становится понятно, почему их обожают владельцы домашних животных по всему миру. Голубой мех происходит от двух рецессивных генов, которые разбавляют черный пигмент до сланцевого или сероватого тона. Эти кошки не просто красивы. Они очень умны, стесняются незнакомцев и, как правило, глубоко привязываются к членам семьи. Они тихие и ласковые, что делает их подходящими для других домашних животных и детей. За счет густой шерсти они кажутся плюшевыми, но их гладкие тела под ней довольно мускулистые.',
    date: '17.06.2025',
    image: 'https://news-img.gismeteo.st/ru/2025/06/shutterstock_2298855307-640x427.jpg',
  },
  {
    id: '4',
    title: 'В Австралии можно встретить треугольного паука',
    content:
      'Треугольный паук Валькенара (Arkys walckenaeri) живет в Австралии и принадлежит к семейству Arkyinae. Эти существа являются засадными охотниками и обладают характерным треугольным брюшком и изогнутыми передними лапками. Название «Валькенара» дано в честь французского ученого Шарля Атаназа Валькенара. Самки достигают длины 4–7 миллиметров, а самцы, как правило, меньше. У этого вида наблюдаются региональные различия: пауки из Квинсленда с оранжевым или красным телом отличаются от бледно-желтых пауков на западе, юге и Тасмании.',
    date: '17.06.2025',
    image: 'https://news-img.gismeteo.st/ru/2025/05/shutterstock_532778128-640x427.jpg',
  },
  {
    id: '5',
    title: 'Клещ или паук: почему очень важно их не путать',
    content:
      'На первый взгляд пауки и клещи выглядят схоже — оба относятся к классу паукообразных. Однако между ними существует ряд существенных различий, знание которых важно не только для интереса, но и для здоровья. При обнаружении укуса клеща необходимо как можно скорее обратиться к врачу. Признаками укуса могут быть покраснение кожи, бледный ореол вокруг воспалённого участка и тёмная точка в месте прикрепления клеща. Важно не трогать паразита голыми руками, не давить и не обрабатывать химикатами. Извлекать его следует аккуратно: с помощью нитки, пинцета, а лучше — специальным устройством, стараясь не повредить тело клеща.',
    date: '17.06.2025',
    image: 'https://news-img.gismeteo.st/ru/2025/05/shutterstock_2447345681-640x428.jpg',
  },
  {
    id: '6',
    title: 'Вы знали, что в пустыне Гоби живут медведи? Они крайне редкие',
    content:
      'В пустыне Гоби обитает одно из самых редких животных на планете — гобийский бурый медведь (Ursus arctos gobiensis), называемый монголами мазаалай. Этот вид считается наиболее редким среди всех медведей, а его существование долгое время воспринималось как миф. Невзирая на свою выносливость, гобийским медведям угрожают экстремальные температуры и горнодобывающая отрасль. В 2019 году они получили международную защиту через Конвенцию по мигрирующим видам. Проект «Гобийский медведь» помогает восстановить этот критически исчезающий вид, оснастив 20 медведей ошейниками слежения для изучения их поведения и миграций.',
    date: '17.06.2025',
    image:
      'https://news-img.gismeteo.st/ru/2025/05/ChatGPT-Image-29-maya-2025-g.-01_18_38-640x427.png',
  },
]
